# ================================================    COMMANDS     =====================================================
CMD_START = '/start'
CMD_MENU = '/menu'
CMD_ADD_SOFT = '/addsoft'
CMD_DEL_SOFT = '/delsoft'
CMD_ADD_PARTNER = '/addpartner'
CMD_DEL_PARTNER = '/delpartner'

CMDS_ADMIN = [CMD_DEL_PARTNER, CMD_ADD_PARTNER, CMD_ADD_SOFT, CMD_DEL_SOFT]
CMDS_CLIENT = [CMD_MENU, CMD_START]


# ================================================    MESSAGES     =====================================================
MSG = {
    'RUS' : {
        'ADMIN' : {
        'MSG_START' : '*Здравствуйте! Нажмите на /menu, чтобы начать работу с ботом*',
        'MSG_MENU' : '*Добро пожаловать!*',
        'MSG_DELSOFT' : '*Выберите софт, который хотите удалить*',
        'MSG_ADDSOFT' : '',
        'MSG_DELPARTNER' : '*Выбери партнера, которого хочешь удалить из базы данных*',
        'MSG_ADDPARTNER' : 'DF',
        'MSG_ADMIN_HELP' : """
*/addsoft* - _добавить софт в бд_
*/delsoft* - _удалить софт из бд_
*/addpartner* - _добавить партнера в бд_
*/delpartner* - _удалить партнера из бд_
*/refresh* - _отчистить одну из таблиц бд_
        """
        },
        'CLIENT' : {
            'MSG_MENU': '',
        },
        'STATES' : {
            'SOFT' : {
                'NAME' : '*Сначала отправь название софта, который хочешь добавить*',
                'DESC' : '*А теперь отправь описание*',
                'PRICE' : '*Теперь отправь цену софта*',
            },
            'PARTNER' : {
                'ID' : '*Сначала отправь id партнера, которого хочешь добавить*',
                'NAME' : '*Теперь введите имя партнера*',
                'PROMO' : '*введите промокод партнера*',
                'DISCOUNT' : '*введите размер скидки промокода*',
                'QUANTITY' : '*введите кол-во промокодов*',
            },
            'MISTAKE' : {
                'INCORRECT INPUT' : '_Некорректный ввод, введите число!_',
                'NO ROOTS' : '*У вас нет прав на использование этой команды!*'
            },
            'OTHERWISE' : 'ответ на сообщение не по шаблону!',
            'DATA_BASE' : '*База данных была обновлена!*'
        }
    }
}